fn main(){
    let my_array: [i32; 5] = [1, 2, 3, 4, 5]; // 定义一个数组，包含5个整数元素。
    // let s1 = &my_array[1..3]; // 创建一个切片，包含数组my_array中索引1到2的元素，即元素2和3。
    let s1 = &my_array[1..=3]; // 创建一个切片，包含数组my_array中索引1到3的元素，即元素2、3和4。
    //s1是一个切片，它的类型是 &[i32]，表示一个只读的整数切片。
    println!("s1 is: {:?}", s1); // 输出切片s1的内容,其中的:? 是一个格式化符，用于格式化切片的内容。

    let s2 = &my_array[..2];
    println!("s2 is: {:?}", s2); // 输出切片s2的内容，包含数组my_array中索引0到1的元素，即元素1和2。
    let s3 = &my_array[2..];
    println!("s3 is: {:?}", s3); // 输出切片s3的内容，包含数组my_array中索引2到4的元素，即元素3、4和5。

    let s4 = &my_array[..];
    println!("s4 is: {:?}", s4); // 输出切片s4的内容，包含数组my_array中的所有元素，即元素1、2、3、4和5。
}